export default {
  '2019': {
    'holiday': [
      {
        'desc': '2018年12月30日至2019年1月1日放假调休，共3天。2018年12月29日（星期六）上班。',
        'festival': '2019-1-1',
        'list': [
          {
            'date': '2018-12-29',
            'status': '2'
          },
          {
            'date': '2018-12-31',
            'status': '1'
          },
          {
            'date': '2019-1-1',
            'status': '1'
          },
          {
            'date': '2018-12-30',
            'status': '1'
          }
        ],
        'list#num#baidu': 4,
        'name': '元旦',
        'rest': '拼假建议：2019年1月2日（周三）~2019年1月4日（周五）请假3天，可拼8天元旦小长假。'
      },
      {
        'desc': '除夕',
        'festival': '2019-2-4',
        'list': [
          {
            'date': '2019-2-4',
            'status': '1'
          }
        ],
        'list#num#baidu': 1,
        'name': '除夕',
        'rest': '农历腊月最后一天为除夕，即大年初一前夜，又称为年三十。'
      },
      {
        'desc': '2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班',
        'festival': '2019-2-5',
        'list': [
          {
            'date': '2019-2-4',
            'status': '1'
          },
          {
            'date': '2019-2-2',
            'status': '2'
          },
          {
            'date': '2019-2-3',
            'status': '2'
          },
          {
            'date': '2019-2-5',
            'status': '1'
          },
          {
            'date': '2019-2-6',
            'status': '1'
          },
          {
            'date': '2019-2-7',
            'status': '1'
          },
          {
            'date': '2019-2-8',
            'status': '1'
          },
          {
            'date': '2019-2-9',
            'status': '1'
          },
          {
            'date': '2019-2-10',
            'status': '1'
          }
        ],
        'list#num#baidu': 9,
        'name': '春节',
        'rest': '拼假建议：2019年2月11日（周一）-2019年2月15日（周五）请假5天，可拼14天春节小长假。'
      },
      {
        'desc': '4月5日放假，与周末连休。',
        'festival': '2019-4-5',
        'list': [
          {
            'date': '2019-4-5',
            'status': '1'
          },
          {
            'date': '2019-4-6',
            'status': '1'
          },
          {
            'date': '2019-4-7',
            'status': '1'
          }
        ],
        'list#num#baidu': 3,
        'name': '清明节',
        'rest': '拼假建议：2019年4月1日（周一）~2019年4月4日（周四）请假4天，可拼9天清明节小长假。'
      },
      {
        'desc': '5月1日放假',
        'festival': '2019-5-1',
        'list': [
          {
            'date': '2019-5-1',
            'status': '1'
          },
          {
            'date': '2019-5-2',
            'status': '1'
          },
          {
            'date': '2019-5-3',
            'status': '1'
          },
          {
            'date': '2019-5-4',
            'status': '1'
          },
          {
            'date': '2019-4-28',
            'status': '2'
          },
          {
            'date': '2019-5-5',
            'status': '2'
          }
        ],
        'list#num#baidu': 6,
        'name': '劳动节',
        'rest': '拼假建议：4月28日（周日）~4月30日（周二）请假3天，可拼8天劳动节小长假。'
      },
      {
        'desc': '6月7日放假，与周末连休。',
        'festival': '2019-6-7',
        'list': [
          {
            'date': '2019-6-7',
            'status': '1'
          },
          {
            'date': '2019-6-8',
            'status': '1'
          },
          {
            'date': '2019-6-9',
            'status': '1'
          }
        ],
        'list#num#baidu': 3,
        'name': '端午节',
        'rest': '拼假建议：2019年6月3日（周一）~2019年6月6日（周四）请假4天，可拼9天端午节小长假。'
      },
      {
        'desc': '9月13日放假，与周末连休。',
        'festival': '2019-9-13',
        'list': [
          {
            'date': '2019-9-13',
            'status': '1'
          },
          {
            'date': '2019-9-14',
            'status': '1'
          },
          {
            'date': '2019-9-15',
            'status': '1'
          }
        ],
        'list#num#baidu': 3,
        'name': '中秋节',
        'rest': '拼假建议：2019年9月9日（周一）~2019年9月12日（周四）请假4天，可拼9天中秋节小长假。'
      },
      {
        'desc': '10月1日至10月7日放假，9月29日（星期日）、10月12日（星期六）上班。',
        'festival': '2019-10-1',
        'list': [
          {
            'date': '2019-10-1',
            'status': '1'
          },
          {
            'date': '2019-9-29',
            'status': '2'
          },
          {
            'date': '2019-10-2',
            'status': '1'
          },
          {
            'date': '2019-10-3',
            'status': '1'
          },
          {
            'date': '2019-10-4',
            'status': '1'
          },
          {
            'date': '2019-10-7',
            'status': '1'
          },
          {
            'date': '2019-10-12',
            'status': '2'
          },
          {
            'date': '2019-10-5',
            'status': '1'
          },
          {
            'date': '2019-10-6',
            'status': '1'
          }
        ],
        'list#num#baidu': 9,
        'name': '国庆节',
        'rest': '拼假建议：9月29日（周日）~9月30日（周一）请2天假，可拼10天国庆节小长假。'
      }
    ],
    'holidaylist': [
      {
        'name': '元旦',
        'startday': '2019-1-1'
      },
      {
        'name': '除夕',
        'startday': '2019-2-4'
      },
      {
        'name': '春节',
        'startday': '2019-2-4'
      },
      {
        'name': '清明节',
        'startday': '2019-4-5'
      },
      {
        'name': '劳动节',
        'startday': '2019-5-1'
      },
      {
        'name': '端午节',
        'startday': '2019-6-7'
      },
      {
        'name': '中秋节',
        'startday': '2019-9-13'
      },
      {
        'name': '国庆节',
        'startday': '2019-10-1'
      }
    ]
  },
  '2020': {
    'holiday': [
      {
        'desc': '1月1日放假一天',
        'festival': '2020-1-1',
        'list': [
          {
            'date': '2020-1-1',
            'status': '1'
          }
        ],
        'list#num#baidu': 1,
        'name': '元旦',
        'rest': '2019年12月30日和2019年12月31日请假两天，与周末连休可拼5天小长假。'
      },
      {
        'desc': '1月24日放假一天',
        'festival': '2020-1-24',
        'list': [
          {
            'date': '2020-1-24',
            'status': '1'
          }
        ],
        'list#num#baidu': 1,
        'name': '除夕',
        'rest': '农历腊月最后一天为除夕，即大年初一前夜，又称为年三十。'
      },
      {
        'desc': '1月24日(除夕)至1月30日放假7天，1月19日，2月1日上班',
        'festival': '2020-1-25',
        'list': [
          {
            'date': '2020-1-24',
            'status': '1'
          },
          {
            'date': '2020-1-25',
            'status': '1'
          },
          {
            'date': '2020-1-26',
            'status': '1'
          },
          {
            'date': '2020-1-27',
            'status': '1'
          },
          {
            'date': '2020-1-28',
            'status': '1'
          },
          {
            'date': '2020-1-29',
            'status': '1'
          },
          {
            'date': '2020-1-30',
            'status': '1'
          },
          {
            'date': '2020-1-19',
            'status': '2'
          },
          {
            'date': '2020-2-1',
            'status': '2'
          }
        ],
        'list#num#baidu': 9,
        'name': '春节',
        'rest': '2020年1月19日至2020年1月23日请假5天，与周末连休可拼13天长假。'
      },
      {
        'desc': '4月4日至4月6日放假3天',
        'festival': '2020-4-4',
        'list': [
          {
            'date': '2020-4-4',
            'status': '1'
          },
          {
            'date': '2020-4-5',
            'status': '1'
          },
          {
            'date': '2020-4-6',
            'status': '1'
          }
        ],
        'list#num#baidu': 3,
        'name': '清明节',
        'rest': '2020年4月7日至2020年4月10日请假4天，与周末连休可拼9天长假。'
      },
      {
        'desc': '5月1日至5月5日放假5天，4月26日，5月9日上班',
        'festival': '2020-5-1',
        'list': [
          {
            'date': '2020-5-1',
            'status': '1'
          },
          {
            'date': '2020-5-2',
            'status': '1'
          },
          {
            'date': '2020-5-3',
            'status': '1'
          },
          {
            'date': '2020-5-4',
            'status': '1'
          },
          {
            'date': '2020-5-5',
            'status': '1'
          },
          {
            'date': '2020-4-26',
            'status': '2'
          },
          {
            'date': '2020-5-9',
            'status': '2'
          }
        ],
        'list#num#baidu': 7,
        'name': '劳动节',
        'rest': '2020年4月26日至2020年4月30日请假5天，与周末连休可拼11天长假。'
      },
      {
        'desc': '6月25日至6月27日放假3天，6月28日上班',
        'festival': '2020-6-25',
        'list': [
          {
            'date': '2020-6-25',
            'status': '1'
          },
          {
            'date': '2020-6-26',
            'status': '1'
          },
          {
            'date': '2020-6-27',
            'status': '1'
          },
          {
            'date': '2020-6-28',
            'status': '2'
          }
        ],
        'list#num#baidu': 4,
        'name': '端午节',
        'rest': '2020年6月22日至2020年6月24日请假3天，与周末连休可拼8天长假。'
      },
      {
        'desc': '10月1日至10月8日放假8天，9月27日，10月10日上班',
        'festival': '2020-10-1',
        'list': [
          {
            'date': '2020-10-1',
            'status': '1'
          },
          {
            'date': '2020-10-2',
            'status': '1'
          },
          {
            'date': '2020-10-3',
            'status': '1'
          },
          {
            'date': '2020-10-4',
            'status': '1'
          },
          {
            'date': '2020-10-5',
            'status': '1'
          },
          {
            'date': '2020-10-6',
            'status': '1'
          },
          {
            'date': '2020-10-7',
            'status': '1'
          },
          {
            'date': '2020-10-8',
            'status': '1'
          },
          {
            'date': '2020-9-27',
            'status': '2'
          },
          {
            'date': '2020-10-10',
            'status': '2'
          }
        ],
        'list#num#baidu': 10,
        'name': '中秋节',
        'rest': '10月9日至10月10日请假2天，与周末连休可拼11天长假。'
      },
      {
        'desc': '10月1日至10月8日放假8天，9月27日，10月10日上班',
        'festival': '2020-10-1',
        'list': [
          {
            'date': '2020-10-1',
            'status': '1'
          },
          {
            'date': '2020-10-2',
            'status': '1'
          },
          {
            'date': '2020-10-3',
            'status': '1'
          },
          {
            'date': '2020-10-4',
            'status': '1'
          },
          {
            'date': '2020-10-5',
            'status': '1'
          },
          {
            'date': '2020-10-6',
            'status': '1'
          },
          {
            'date': '2020-10-7',
            'status': '1'
          },
          {
            'date': '2020-10-8',
            'status': '1'
          },
          {
            'date': '2020-9-27',
            'status': '2'
          },
          {
            'date': '2020-10-10',
            'status': '2'
          }
        ],
        'list#num#baidu': 10,
        'name': '国庆节',
        'rest': '10月9日至10月10日请假2天，与周末连休可拼11天长假。'
      }
    ],
    'holidaylist': [
      {
        'name': '元旦',
        'startday': '2020-1-1'
      },
      {
        'name': '除夕',
        'startday': '2020-1-24'
      },
      {
        'name': '春节',
        'startday': '2020-1-25'
      },
      {
        'name': '清明节',
        'startday': '2020-4-4'
      },
      {
        'name': '劳动节',
        'startday': '2020-5-1'
      },
      {
        'name': '端午节',
        'startday': '2020-6-25'
      },
      {
        'name': '中秋节',
        'startday': '2020-10-1'
      },
      {
        'name': '国庆节',
        'startday': '2020-10-1'
      }
    ]
  }
}
